Tekla Open API Reference for Tekla Structures 2025
Text Constructor (ViewBase, Point, String, Text.TextAttributes)
 Creates a new text instance with the given text string and text attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Text(
	ViewBase view,
	Point insertionPoint,
	string Text,
	Text.TextAttributes inAttributes
)
Public Sub New (
	view As ViewBase,
	insertionPoint As Point,
	Text As String,
	inAttributes As Text.TextAttributes
)
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
insertionPoint
Type: Tekla.Structures.Geometry3d.Point
The insertion point to be used.
Text
Type: System.String
The text string to be used.
inAttributes
Type: Tekla.Structures.Drawing.Text.TextAttributes
The text attributes to be used.
See Also
Reference
Text Class
Text Overload
Tekla.Structures.Drawing Namespace